app/controllers/trekking_controller.rb

INSERT INTO "mapas" ("created_at", "updated_at", "url", "url_link") VALUES (?, ?, ?, ?)  [["created_at", Sun, 06 Nov 2011 15:45:12 UTC +00:00], ["updated_at", Sun, 06 Nov 2011 15:45:12 UTC +00:00], ["url", "cos"], ["url_link", nil]]
SELECT "mapas".* FROM "mapas" ORDER BY created_at DESC LIMIT 5
---

		@size = size

		Mapa.create(:url => view_context.getMap(lat,lng,@zoom,$center,size) , :url_link => "&lata="+ lat[0] +"&lnga="+ lng[0] +"&latb="+ lat[1] +"&lngb="+ lng[1] +"&zoom="+ @zoom +"")

		@mapy = Mapa.order("created_at DESC").limit(5)